In [2]:
import pymysql

In [8]:
db = pymysql.connect(host='localhost', user='root', password='050801')
print(db)

<pymysql.connections.Connection object at 0x000002143C2A84A0>

In [9]:
myc = db.cursor()
print(myc)

<pymysql.cursors.Cursor object at 0x000002143D212000>

In [10]:
myc.execute('show databases')
print(myc.fetchall())

(('28feb25',), ('db_spj_jason',), ('db_w6_jason',), ('db_w7_syc',), ('information_schema',), ('j28feb',), ('jason21feb25',), ('jason_db_ch02',), ('jason_db_hw07',), ('jasonhw01',), ('mysql',), ('performance_schema',), ('pms01_j',), ('sys',), ('w09_syc',))

In [ ]:
# Create database
myc.execute("CREATE DATABASE W09_SYC;")
myc.execute("show databases")
print(myc.fetchall())
print("Database created")

In [12]:
myc.execute('use W09_SYC;')

0

In [ ]:
myc.execute('CREATE TABLE GRADE(id INT PRIMARY KEY, name VARCHAR(36))')
myc.execute('show tables')
print(myc.fetchall())

(('grade',),)

In [ ]:
myc.execute('CREATE TABLE STUDENT(sid INT PRIMARY KEY, sname VARCHAR(36), gid INT NOT NULL)')
myc.execute('show tables')
print(myc.fetchall())

(('grade',), ('student',))

In [ ]:
myc.execute('DESC STUDENT')
print(myc.fetchall())

(('sid', 'int', 'NO', 'PRI', None, ''), ('sname', 'varchar(36)', 'YES', '', None, ''), ('gid', 'int', 'NO', '', None, ''))

In [ ]:
myc.execute('ALTER TABLE STUDENT ADD CONSTRAINT KF_ID FOREIGN KEY(gid) REFERENCES GRADE(id)')

0

In [ ]:
myc.execute('DESC STUDENT')
print(myc.fetchall())

(('sid', 'int', 'NO', 'PRI', None, ''), ('sname', 'varchar(36)', 'YES', '', None, ''), ('gid', 'int', 'NO', 'MUL', None, ''))

In [ ]:
myc.execute('show create table STUDENT')
print(myc.fetchall())

(('STUDENT', 'CREATE TABLE `student` (\n  `sid` int NOT NULL,\n  `sname` varchar(36) DEFAULT NULL,\n  `gid` int NOT NULL,\n  PRIMARY KEY (`sid`),\n  KEY `KF_ID` (`gid`),\n  CONSTRAINT `KF_ID` FOREIGN KEY (`gid`) REFERENCES `grade` (`id`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci'),)

In [ ]:
myc.execute('alter table STUDENT drop foreign key KF_ID')
myc.execute('show create table STUDENT')
print(myc.fetchall())

(('STUDENT', 'CREATE TABLE `student` (\n  `sid` int NOT NULL,\n  `sname` varchar(36) DEFAULT NULL,\n  `gid` int NOT NULL,\n  PRIMARY KEY (`sid`),\n  KEY `KF_ID` (`gid`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci'),)

In [13]:
myc.execute('ALTER TABLE STUDENT ADD CONSTRAINT KF_ID FOREIGN KEY(gid) REFERENCES GRADE(id);')

0

In [14]:
myc.execute('DESC STUDENT')
print(myc.fetchall())

(('sid', 'int', 'NO', 'PRI', None, ''), ('sname', 'varchar(36)', 'YES', '', None, ''), ('gid', 'int', 'NO', 'MUL', None, ''))

In [16]:
myc.execute('''
insert into GRADE (id, name)
values
(1, 'BIT'),
(2, 'BCS');
''')

2

In [17]:
myc.execute('select * from GRADE')
print(myc.fetchall())

((1, 'BIT'), (2, 'BCS'))

In [19]:
myc.execute('''
insert into STUDENT (sid, sname, gid)
values
(1, 'Alice', 1),
(2, 'Bob', 1),
(3, 'Cathy', 2),
(4, 'David', 2);
''')

4

In [21]:
myc.execute('select * from STUDENT;')
print(myc.fetchall())

((1, 'Alice', 1), (2, 'Bob', 1), (3, 'Cathy', 2), (4, 'David', 2))

In [ ]:
myc.execute('''select id from grade where name = "BIT"''')
print(myc.fetchall())

((1,),)

In [26]:
myc.execute('''select sname from student where gid = 1''')
print(myc.fetchall())

(('Alice',), ('Bob',))

In [27]:
myc.execute('delete from student where gid = 1')
myc.execute(''' delete from grade where name = "BIT"''')

1

In [28]:
myc.execute('create table department (did int primary key, dname varchar(36))')
myc.execute('show tables')
print(myc.fetchall())

(('department',), ('grade',), ('student',))

In [29]:
myc.execute('create table employee (id int primary key, name varchar(36), age int, did int not null)')
myc.execute('show tables')
print(myc.fetchall())

(('department',), ('employee',), ('grade',), ('student',))

In [31]:
myc.execute(''' insert into department (did, dname)
values
(1, 'IT'),
(2, 'FID'),
(3, 'QA'),
(4, 'HR');
''')

4

In [33]:
myc.execute('select * from department')
print(myc.fetchall())

((1, 'IT'), (2, 'FID'), (3, 'QA'), (4, 'HR'))

In [34]:
myc.execute('''
insert into employee (id, name, age, did)
values
(1, 'Gary', 30, 1),
(2, 'Sean', 25, 1),
(3, 'Jane', 20, 2),
(4, 'Mark', 23, 4);
''')

4

In [35]:
myc.execute('select * from employee')
print(myc.fetchall())

((1, 'Gary', 30, 1), (2, 'Sean', 25, 1), (3, 'Jane', 20, 2), (4, 'Mark', 23, 4))

In [ ]:
myc.execute('SHOW CREATE TABLE EMPLOYEE')
print(myc.fetchall())

(('EMPLOYEE', 'CREATE TABLE `employee` (\n  `id` int NOT NULL,\n  `name` varchar(36) DEFAULT NULL,\n  `age` int DEFAULT NULL,\n  `did` int NOT NULL,\n  PRIMARY KEY (`id`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci'),)

In [ ]:
myc.execute('select * from department join employee')
for i in myc.fetchall():
    print(i)

(4, 'HR', 1, 'Gary', 30, 1)
(3, 'QA', 1, 'Gary', 30, 1)
(2, 'FID', 1, 'Gary', 30, 1)
(1, 'IT', 1, 'Gary', 30, 1)
(4, 'HR', 2, 'Sean', 25, 1)
(3, 'QA', 2, 'Sean', 25, 1)
(2, 'FID', 2, 'Sean', 25, 1)
(1, 'IT', 2, 'Sean', 25, 1)
(4, 'HR', 3, 'Jane', 20, 2)
(3, 'QA', 3, 'Jane', 20, 2)
(2, 'FID', 3, 'Jane', 20, 2)
(1, 'IT', 3, 'Jane', 20, 2)
(4, 'HR', 4, 'Mark', 23, 4)
(3, 'QA', 4, 'Mark', 23, 4)
(2, 'FID', 4, 'Mark', 23, 4)
(1, 'IT', 4, 'Mark', 23, 4)

In [41]:
myc.execute('select * from department join employee on department.did = employee.did')
for i in myc.fetchall():
    print(i)

(1, 'IT', 1, 'Gary', 30, 1)
(1, 'IT', 2, 'Sean', 25, 1)
(2, 'FID', 3, 'Jane', 20, 2)
(4, 'HR', 4, 'Mark', 23, 4)

In [43]:
myc.execute('select * from department join employee using (did)')
for i in myc.fetchall():
    print(i)

(1, 'IT', 1, 'Gary', 30)
(1, 'IT', 2, 'Sean', 25)
(2, 'FID', 3, 'Jane', 20)
(4, 'HR', 4, 'Mark', 23)

In [44]:
myc.execute('select employee.name, department.dname from department, employee where department.did = employee.did')
for i in myc.fetchall():
    print(i)

('Gary', 'IT')
('Sean', 'IT')
('Jane', 'FID')
('Mark', 'HR')

In [45]:
myc.execute('select p1.* from employee p1 join employee p2 on p1.did = p2.did where p2.name = "Gary"')
for i in myc.fetchall():
    print(i)

(1, 'Gary', 30, 1)
(2, 'Sean', 25, 1)

In [47]:
myc.execute('select department.did, department.dname, employee.name from department left join employee on department.did = employee.did')
for i in myc.fetchall():
    print(i)

(1, 'IT', 'Sean')
(1, 'IT', 'Gary')
(2, 'FID', 'Jane')
(3, 'QA', None)
(4, 'HR', 'Mark')